Revit 2026 API

# ColorWithTransparencySetBlue Method

---

set blue

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetBlue(
	uint blue
)
```
```vb
Public Sub SetBlue (
	blue As UInteger
)
```
```cpp
public:
void SetBlue(
	unsigned int blue
)
```
```fsharp
member SetBlue :
        blue : uint32 -> unit
```

#### Parameters

blue UInt32
     blue

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The value is not valid. The valid range is 0 to 255. |

#### Reference

ColorWithTransparency Class

Autodesk.Revit.DB Namespace